quest_system_1946655882_name=^?^Griffin's Crown
quest_system_1946655882_stage_0=^?^Speak to the Governor of the Islands of Freedom.
quest_system_1946655882_stage_1=^?^Take by storm Castle Totenheim, which is on the Eastern Islands. In this castle lives Duke Sov and his gang.
quest_system_1946655882_stage_2=^?^Collect the reward from the Governor.
quest_system_1946655882_stage_3=^?^Return the crown to King Harl.
quest_system_1946655882_task=^?^King Harl of the Griffins asks you to find and return the stolen Griffin's Crown. He believes that the thief is Scott Thompson, Governor of the Islands of Freedom.<br>[reward]
